#+TITLE: Ruby Solutions
#+OPTIONS: ^:nil
#+STARTUP: content

* Sonar Sweep (Dag 1)
** First Part
#+begin_src ruby :results output
  numbers = Array.new
  file = File.open("SonarSweepInput.txt", "r")
  while !file.eof?
    tmp = file.readline.to_i
    numbers.append(tmp)
  end
  
  sum = 0
  prevNumber = numbers.first
  numbers.each do |currentNumber|
    if currentNumber > prevNumber
      sum += 1
    end
    prevNumber = currentNumber
  end
  puts sum
  
#+end_src

#+RESULTS:
: 1390

** Second Part
#+begin_src ruby :results output
  numbers = Array.new
  file = File.open("SonarSweepInput.txt", "r")
  while !file.eof?
    tmp = file.readline.to_i
    numbers.append(tmp)
  end
  
  sum = 0
  
  for i in 3..numbers.length-1
    if numbers[i-3] < numbers[i]
      sum += 1
    end
  end
  
  puts sum
  
#+end_src

#+RESULTS:
: 1457


* Dive! (Dag 2)
** First Part
#+begin_src ruby :results output
  input = Array.new
  file = File.open("DiveInput.txt", "r")
  while !file.eof?
    element = file.readline
    input.append(element)
  end

  horizontalPos = 0
  depthPos = 0

  input.each do |content|
    direction, value = content.split(' ')
    case direction
      when "forward"
        horizontalPos += value.to_i
      when "up"
        depthPos -= value.to_i
      when "down"
        depthPos += value.to_i
      else
        puts "Something is wrong!"
      end
  end

  puts depthPos * horizontalPos
#+end_src

#+RESULTS:
: 2073315

** Part Two
#+begin_src ruby :results output
  input = Array.new
  file = File.open("DiveInput.txt", "r")
  while !file.eof?
    element = file.readline
    input.append(element)
  end

  horizontalPos = 0
  depthPos = 0
  aim = 0

  input.each do |content|
    direction, value = content.split(' ')
    case direction
      when "forward"
        horizontalPos += value.to_i
        depthPos += aim * value.to_i
      when "up"
        aim -= value.to_i
      when "down"
        aim += value.to_i
      else
        puts "Something is wrong!"
      end
  end

  puts depthPos * horizontalPos
#+end_src

#+RESULTS:
: 1840311528

